viveky1794/stm32f103c8_scratch/gpio_Driver_001/myDriver_001/INC/stm32f103c8_MCU.h
//*************************************************************************************************//
//								EXIT INTREEUPT SECTION
//
//*************************************************************************************************//

/**
 * @brief STM32F10x Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

/******  STM32 specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
  PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detection Interrupt            */
  TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
  RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
  FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
  RCC_IRQn                    = 5,      /*!< RCC global Interrupt                                 */
  EXTI0_IRQn                  = 6,      /*!< EXTI Line0 Interrupt                                 */
  EXTI1_IRQn                  = 7,      /*!< EXTI Line1 Interrupt                                 */
  EXTI2_IRQn                  = 8,      /*!< EXTI Line2 Interrupt                                 */
  EXTI3_IRQn                  = 9,      /*!< EXTI Line3 Interrupt                                 */
  EXTI4_IRQn                  = 10,     /*!< EXTI Line4 Interrupt                                 */
  DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
  EXTI9_5_IRQ				  = 23,		/*!< EXTI Line9_5 interrupt								  */
} IRQn_Type;














/******************************	NVIC Register Address	******************************************
 *
 * 				Processor Specific	Interrupt Set-Enable Registers
 */

#define NVIC_ISER_BASEADDR				( (__vo uint32_t *)0xE000E100 )

typedef struct
{
	__vo uint32_t ISER0;
	__vo uint32_t ISER1;
	__vo uint32_t ISER2;
	__vo uint32_t ISER3;
	__vo uint32_t ISER4;
	__vo uint32_t ISER5;
	__vo uint32_t ISER6;
	__vo uint32_t ISER7;
}NVIC_ISERx_TypeDef;

#define NVIC_Set_Interrupt	((NVIC_ISERx_TypeDef *)(NVIC_ISER_BASEADDR))

/*
 * 				Processor Specific	Interrupt Clear-Enable Registers
 */

#define NVIC_ICER_BASEADDr  	( (__vo uint32_t*)(0XE000E180) )

typedef struct
{
	__vo uint32_t ICER0;
	__vo uint32_t ICER1;
	__vo uint32_t ICER2;
	__vo uint32_t ICER3;
	__vo uint32_t ICER4;
	__vo uint32_t ICER5;
	__vo uint32_t ICER6;
	__vo uint32_t ICER7;
}NVIC_ICERx_TypeDef;

#define NVIC_Clear_Interrupt	((NVIC_ICERx_TypeDef *)(NVIC_ISER_BASEADDR))


/*
 * 			Processor Specific	Interrupt Set-Pending Registers
 */
#define NVIC_ISPR_BASEADDR		((__vo uint32_t *)0XE000E200)

typedef struct
{
	__vo uint32_t ISPR0;
	__vo uint32_t ISPR1;
	__vo uint32_t ISPR2;
	__vo uint32_t ISPR3;
	__vo uint32_t ISPR4;
	__vo uint32_t ISPR5;
	__vo uint32_t ISPR6;
	__vo uint32_t ISPR7;
}NVIC_ISPRx_TypeDef;

#define NVIC_Set_Pending_Bit	((NVIC_ISPRx_TypeDef *)(NVIC_ISPR_BASEADDR))

/*
 * 			Processor Specific	Interrupt CLEAR-Pending Registers
 */

#define NVIC_ICPR_BASEADDR		(__vo uint32_t *)(0XE000E280)

typedef struct
{
	__vo uint32_t ICPR0;
	__vo uint32_t ICPR1;
	__vo uint32_t ICPR2;
	__vo uint32_t ICPR3;
	__vo uint32_t ICPR4;
	__vo uint32_t ICPR5;
	__vo uint32_t ICPR6;
	__vo uint32_t ICPR7;
}NVIC_ICPRx_TypeDef;

#define NVIC_Clear_Pending_Bit	((NVIC_ICPRx_TypeDef *)(NVIC_ICPR_BASEADDR))

/*
 *			Processor Specific	Interrupt PRIORITY Registers
 */
#define NVIC_IPR_BaseAddr		( (__vo uint32_t *)(0xE000E400) )

typedef struct
{
	__vo uint32_t IPR0;
	__vo uint32_t IPR1;
	__vo uint32_t IPR2;
	__vo uint32_t IPR3;
	__vo uint32_t IPR4;
	__vo uint32_t IPR5;
	__vo uint32_t IPR6;
	__vo uint32_t IPR7;
	__vo uint32_t IPR8;
	__vo uint32_t IPR9;
	__vo uint32_t IPR10;
	__vo uint32_t IPR11;
	__vo uint32_t IPR12;
	__vo uint32_t IPR13;
	__vo uint32_t IPR14;

}NVIC_IPR_TypeDef;

#define NVIC_Priority_Reg	((NVIC_IPR_TypeDef *)(NVIC_IPR_BaseAddr))
#define NO_PR_BITS_IMPLEMENTED	4

// TODO : Priority Register is upto 59

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for NVIC_ISER register  *******************/
#define  NVIC_ISER_SETENA                    ((uint32_t)0xFFFFFFFF)        /*!< Interrupt set enable bits */
#define  NVIC_ISER_SETENA_0                  ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ISER_SETENA_1                  ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ISER_SETENA_2                  ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ISER_SETENA_3                  ((uint32_t)0x00000008)        /*!< bit 3 */
#define  NVIC_ISER_SETENA_4                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ISER_SETENA_5                  ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ISER_SETENA_6                  ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ISER_SETENA_7                  ((uint32_t)0x00000080)        /*!< bit 7 */
#define  NVIC_ISER_SETENA_8                  ((uint32_t)0x00000100)        /*!< bit 8 */
#define  NVIC_ISER_SETENA_9                  ((uint32_t)0x00000200)        /*!< bit 9 */
#define  NVIC_ISER_SETENA_10                 ((uint32_t)0x00000400)        /*!< bit 10 */
#define  NVIC_ISER_SETENA_11                 ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ISER_SETENA_12                 ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ISER_SETENA_13                 ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ISER_SETENA_14                 ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ISER_SETENA_15                 ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ISER_SETENA_16                 ((uint32_t)0x00010000)        /*!< bit 16 */
#define  NVIC_ISER_SETENA_17                 ((uint32_t)0x00020000)        /*!< bit 17 */
#define  NVIC_ISER_SETENA_18                 ((uint32_t)0x00040000)        /*!< bit 18 */
#define  NVIC_ISER_SETENA_19                 ((uint32_t)0x00080000)        /*!< bit 19 */
#define  NVIC_ISER_SETENA_20                 ((uint32_t)0x00100000)        /*!< bit 20 */
#define  NVIC_ISER_SETENA_21                 ((uint32_t)0x00200000)        /*!< bit 21 */
#define  NVIC_ISER_SETENA_22                 ((uint32_t)0x00400000)        /*!< bit 22 */
#define  NVIC_ISER_SETENA_23                 ((uint32_t)0x00800000)        /*!< bit 23 */
#define  NVIC_ISER_SETENA_24                 ((uint32_t)0x01000000)        /*!< bit 24 */
#define  NVIC_ISER_SETENA_25                 ((uint32_t)0x02000000)        /*!< bit 25 */
#define  NVIC_ISER_SETENA_26                 ((uint32_t)0x04000000)        /*!< bit 26 */
#define  NVIC_ISER_SETENA_27                 ((uint32_t)0x08000000)        /*!< bit 27 */
#define  NVIC_ISER_SETENA_28                 ((uint32_t)0x10000000)        /*!< bit 28 */
#define  NVIC_ISER_SETENA_29                 ((uint32_t)0x20000000)        /*!< bit 29 */
#define  NVIC_ISER_SETENA_30                 ((uint32_t)0x40000000)        /*!< bit 30 */
#define  NVIC_ISER_SETENA_31                 ((uint32_t)0x80000000)        /*!< bit 31 */

